UMSATS/cdh-tsat/cdh-tsat6-stm32project-nucleo/Drivers/Hardware_Peripherals/Src/W25N_driver.c
/*
 * FILENAME: W25N_driver.c
 *
 * DESCRIPTION: STM32L4 driver source file for the W25N01GVZEIG NAND Flash.
 *
 * AUTHORS:
 *  - Daigh Burgess (daigh.burgess@umsats.ca)
 *  - Rodrigo Alegria (rodrigo.alegria@umsats.ca)
 *
 * CREATED ON: Oct. 30, 2022
 */

//###############################################################################################
//Include Directives
//###############################################################################################
#include <stdint.h>

#include "stm32l4xx_hal.h"
#include "W25N_driver.h"

//###############################################################################################
//Define Directives
//###############################################################################################
#define W25N_DUMMY_BYTE                         0x00

#define W25N_OPCODE_DEVICE_RESET                0xFF
#define W25N_OPCODE_READ_JEDEC_ID               0x9F
#define W25N_OPCODE_READ_STATUS_REGISTER        0x0F
#define W25N_OPCODE_WRITE_STATUS_REGISTER       0x1F
#define W25N_OPCODE_WRITE_ENABLE                0x06
#define W25N_OPCODE_WRITE_DISABLE               0x04
#define W25N_OPCODE_BAD_BLOCK_MANAGEMENT        0xA1
#define W25N_OPCODE_READ_BBM_LUT                0xA5
#define W25N_OPCODE_BLOCK_ERASE_128KB           0xD8
#define W25N_OPCODE_LOAD_PROGRAM_DATA           0x02
#define W25N_OPCODE_PROGRAM_EXECUTE             0x10
#define W25N_OPCODE_PAGE_DATA_READ              0x13
#define W25N_OPCODE_READ_DATA                   0x03

//###############################################################################################
//Global Variable Declarations
//###############################################################################################
extern SPI_HandleTypeDef W25N_SPI;

//###############################################################################################
//Driver Function Prototypes
//###############################################################################################
/*
 * FUNCTION: W25N_Device_Reset
 *
 * DESCRIPTION: Terminates current internal operations and allows the device to return to its 
 *              default power-on state and lose all the current volatile settings.
 *
 * NOTES:
 *  - This function ensures the internal reset is complete by delaying for 1 ms. (tRST can be 5us - 500us)
 *  - Data corruption may happen if there is an ongoing internal Erase or Program operation.
 *    It is recommended by the manufacturer to ensure the BUSY bit in Status Register is 0 before
 *    issuing the Reset command. THIS FUNCTION DOES NOT CHECK THE BUSY BIT BEFORE RESETTING.
 */
W25N_StatusTypeDef W25N_Device_Reset();

/*
 * FUNCTION: W25N_Read_Status_Register
 *
 * DESCRIPTION: Reads the specified 8-bit Status Register.
 *
 * NOTES:
 *  - This instruction may be used at any time, even while the BUSY status bit is 1.
 *  - The Status Register can be read continuously.
 *
 * PARAMETERS:
 *  register_address: The Status Register address. (SR-1 : 0xA0, SR-2 : 0xB0, SR-3 : 0xC0)
 *  p_buffer: Pointer to the buffer which will contain the outputted Status Register byte.
 */
W25N_StatusTypeDef W25N_Read_Status_Register(uint8_t register_address, uint8_t *p_buffer);

/*
 * FUNCTION: W25N_Write_Status_Register
 *
 * DESCRIPTION: Write to the specified 8-bit Status Register.
 *
 * NOTES:
 *  - The writable Status Register bits include:
 *      Status Register-1: SRP[1:0], TB, BP[3:0], WP-E
 *      Status Register-2: OTP-L, OTP-E, SR1-L, ECC-E, BUF
 *  - All other Status Register bits are read-only and will not be affected by the Write Status 
 *    Register instruction.
 * 
 * PARAMETERS:
 *  register_address: The Status Register address. (SR-1 : 0xA0, SR-2 : 0xB0, SR-3 : 0xC0)
 *  register_value: The value to be written to the Status Register.
 */
W25N_StatusTypeDef W25N_Write_Status_Register(uint8_t register_address, uint8_t register_value);

/*
 * FUNCTION: W25N_Write_Enable
 *
 * DESCRIPTION: Sets the Write Enable Latch (WEL) in Status Register-1 to the value 1.
 *
 * NOTES:
 *  - The WEL must be set prior to every Page Program, Block Erase, & Bad Block Management instruction.
 */
W25N_StatusTypeDef W25N_Write_Enable();

/*
 * FUNCTION: W25N_Write_Disable
 *
 * DESCRIPTION: Resets the Write Enable Latch (WEL) in Status Register-1 to the value 0.
 *
 * NOTES:
 *  - A WEL value of 0 will prevent the Page Program, Block Erase, & Bad Block Management instructions 
 *    from executing.
 *  - The WEL is automatically reset after Power-up.
 *  - The WEL is automatically reset after completion of the Page Program, Block Erase, Reset, & Bad 
 *    Block Management instructions.
 */
W25N_StatusTypeDef W25N_Write_Disable();

/*
 * FUNCTION: W25N_Bad_Block_Management
 *
 * DESCRIPTION: Adds a link between a logical block address (LBA) and a physical block address
 *              (PBA) to the internal Bad Block Management (BBM) Look Up Table (LUT). The logical
 *              block address is the address for the bad block that will be replaced by the good
 *              block indicated by the physical block address.
 *
 * NOTES:
 *  - A Write Enable command must be executed before the device will accept the BBM command.
 *  - Up to 20 links can be established in the LUT. If all 20 links have been written, the LUT-F
 *    bit in the Status Register will become a 1, and no more LBA-PBA links can be established.
 *    Therefore, prior to issuing the BBM command, the LUT-F bit should be checked to confirm if
 *    spare links are still available in the LUT.
 *  - Registering the same address in multiple PBAs is prohibited.
 *  - The parameters are BLOCK ADDRESSES, not page addresses within the specific block
 *
 * PARAMETERS:
 *  logical_block_address: Address of the bad block which will be replaced by the good block.
 *  physical_block_address: Address of the good block which will replace the bad block.
 */
W25N_StatusTypeDef W25N_Bad_Block_Management(uint16_t logical_block_address, uint16_t physical_block_address);

//NOTE: CHECK IF ACTUALLY PAGE ADDRESS (ANY PAGE ADDRESS WITHIN BLOCK WE WANT TO ERASE)
//OR BLOCK ADDRESS (DATASHEET SAYS PAGE ADDRESS)
/*
 * FUNCTION: W25N_Block_Erase_128KB
 *
 * DESCRIPTION: Sets all memory within a specified block (64Pages, 128KBytes) to the erased state
 *              of all 1s (0xFF).
 *
 * NOTES:
 *  - A Write Enable command must be executed before the device will accept the Block Erase
 *    command.
 *  - After executing this function, the self-timed Block Erase cycle will commence for a maximum
 *    time duration of 10 ms. While the Block Erase cycle is in progress, the Read Status
 *    Register command may still be used to check the BUSY bit. The BUSY bit is a 1 during the
 *    Block Erase cycle and becomes a 0 when the cycle is finished and the device is ready to
 *    accept other instructions again.
 *  - After the Block Erase cycle has finished, the Write Enable Latch (WEL) bit in the Status
 *    Register is cleared to 0.
 *  - The Block Erase command will not be executed if the addressed block is protected by the
 *    Block Protect (TB, BP2, BP1, BP0) bits.
 *
 * PARAMETERS:
 *  page_address:
 */
W25N_StatusTypeDef W25N_Block_Erase_128KB(uint16_t page_address);

