UMSATS/cdh-tsat/cdh-tsat6-stm32project-nucleo/Drivers/Hardware_Peripherals/Src/W25N_driver.c
/*
 * FUNCTION: W25N_Load_Program_Data
 *
 * DESCRIPTION: Loads data into the W25N Data Buffer from a given buffer. Resets the unused data
 *              bytes in the W25N Data Buffer to 0xFF.
 *
 * NOTES:
 *  - A Write Enable command must be executed before the device will accept the Load Program Data
 *    command.
 *  - The 0th data byte in the buffer will be loaded into the W25N Data Buffer at the given
 *    column address. The 1st data byte will be loaded at the given column address + 1, etc.
 *  - ECC will be used for each page, making each page effectively have 2048 data bytes.
 *    Therefore, the W25N Data Buffer will also effectively have 2048 data bytes. Any sent data
 *    bytes that exceed this addressable range will be discarded.
 *
 * PARAMETERS:
 *  p_buffer: Pointer to the buffer which contains the data bytes to load.
 *  column_address: W25N Data Buffer memory address for the 0th byte to load.
 *  num_of_bytes: Number of bytes to load from the buffer into the W25N Data Buffer.
 */
W25N_StatusTypeDef W25N_Load_Program_Data(uint8_t *p_buffer, uint16_t column_address, uint16_t num_of_bytes);

/*
 * FUNCTION: W25N_Program_Execute
 *
 * DESCRIPTION: Programs the W25N Data Buffer contents into the specified physical memory page.
 *
 * NOTES:
 *  - A Write Enable command must be executed before the device will accept the Program Execute
 *    command. However, note that the Load Program Data command does not clear the Write Enable
 *    Latch (WEL) bit in the Status Register.
 *  - After executing this function, the self-timed Program Execute cycle will commence for a
 *    maximum time duration of 700 us. While the Program Execute cycle is in progress, the Read
 *    Status Register command may still be used to check the BUSY bit. The BUSY bit is a 1 during
 *    the Program Execute cycle and becomes a 0 when the cycle is finished and the device is
 *    ready to accept other instructions again.
 *  - After the Program Execute cycle has finished, the WEL bit in the Status Register is cleared
 *    to 0.
 *  - The Program Execute command will not be executed if the addressed block is protected by the
 *    Block Protect (TB, BP2, BP1, BP0) bits.
 *  - Only 4 partial page programs are allowed on every single page. After 4 partial page
 *    programs are completed on the same page, the page must be erased before being programmed
 *    again. This is due to successive partial page programs increasing the bit error rate.
 *  - Pages within a block have to be programmed sequentially from lower order page addresses to
 *    higher order page addresses. Programming pages out of sequence is prohibited. This is due
 *    to programming pages out of sequence increasing the bit error rate.
 *
 * PARAMETERS:
 *  page_address: Address of the physical memory page to program the W25N Data Buffer into.
 */
W25N_StatusTypeDef W25N_Program_Execute(uint16_t page_address);

/*
 * FUNCTION: W25N_Page_Data_Read
 *
 * DESCRIPTION: Transfers the data of the specified memory page into the W25N Data Buffer.
 *
 * NOTES:
 *  - After executing this function, the self-timed Read Page Data cycle will commence for a
 *    maximum time duration of 60 us. While the Read Page Data cycle is in progress, the Read
 *    Status Register command may still be used to check the BUSY bit. The BUSY bit is a 1 during
 *    the Read Page Data cycle and becomes a 0 when the cycle is finished and the device is ready
 *    to accept other instructions again.
 *
 * PARAMETERS:
 *  page_address: Address of the physical memory page to transfer into the W25N Data Buffer.
 */
W25N_StatusTypeDef W25N_Page_Data_Read(uint16_t page_address);

/*
 * FUNCTION: W25N_Read_Data
 *
 * DESCRIPTION: Reads one or more data bytes from the W25N Data Buffer and stores the result in a
 *              given buffer.
 *
 * NOTES:
 *  - ECC will be used for each page, making the W25N Data Buffer effectively 2048 data bytes
 *    followed by 64 ECC bytes (2112 total bytes).
 *  - Buffer Read Mode will be used, therefore once the last data byte is output from the W25N
 *    Data Buffer, the output pin will become Hi-Z state.
 *  - The 0th data byte in the buffer will be loaded from the W25N Data Buffer at the given
 *    column address. The 1st data byte will be loaded from the W25N Data Buffer at the given
 *    column address + 1, etc.
 *
 * PARAMETERS:
 *  p_buffer: Pointer to the buffer which will contain the output data bytes.
 *  column_address: W25N Data Buffer memory address for the 0th byte to output.
 *  num_of_bytes: Number of bytes to output from the W25N Data Buffer into the buffer.
 */
W25N_StatusTypeDef W25N_Read_Data(uint8_t *p_buffer, uint16_t column_address, uint16_t num_of_bytes);

//###############################################################################################
//High-Level Driver Function Prototypes
//###############################################################################################
/*
 * FUNCTION: W25N_Wait_Until_Not_Busy
 *
 * DESCRIPTION: Waits until the BUSY status bit is 0 (not busy).
 *
 * NOTES:
 *  - Waits a maximum of 10ms. This is the maximum possible time the W25N can be busy. 
 *  - This function blocks using the HAL_Delay function.
 * 
 * W25N_StatusTypeDef SPECIFIC RETURNS:
 *  W25N_READY: The W25N is no longer busy.
 *  W25N_HANGING: The W25N is hanging since it was busy for longer than 10ms.
 */
W25N_StatusTypeDef W25N_Wait_Until_Not_Busy();

/*
 * FUNCTION: W25N_Check_LUT_Full
 *
 * DESCRIPTION: Checks if the Bad Block Management (BBM) Look Up Table (LUT) is full.
 * 
 * W25N_StatusTypeDef SPECIFIC RETURNS:
 *  W25N_LUT_HAS_ROOM: There is still room to add to the BBM LUT.
 *  W25N_LUT_FULL: The BBM LUT is full.
 */
W25N_StatusTypeDef W25N_Check_LUT_Full();

/*
 * FUNCTION: W25N_Check_ECC_Status
 *
 * DESCRIPTION: Check the ECC status of the most recent read operation.
 * 
 * W25N_StatusTypeDef SPECIFIC RETURNS:
 *  W25N_ECC_CORRECTION_UNNECESSARY: No ECC correction was necessary.
 *  W25N_ECC_CORRECTION_OK: There were 1-4 bit errors for the page which were successfully corrected.
 *  W25N_ECC_CORRECTION_ERROR: ECC correction was unsuccessful since there were more than 4 bit 
 *                             errors for the page.
 */
W25N_StatusTypeDef W25N_Check_ECC_Status();

