UMSATS/cdh-tsat/cdh-tsat6-stm32project-nucleo/Drivers/Hardware_Peripherals/Src/W25N_driver.c
    operation_status = W25N_Check_LUT_Full();
    if (operation_status != W25N_LUT_HAS_ROOM) goto error;

    operation_status = W25N_Write_Enable();
    if (operation_status != W25N_HAL_OK) goto error;

    operation_status = W25N_Bad_Block_Management(logical_block_address, physical_block_address);
    if (operation_status != W25N_HAL_OK) goto error;

    operation_status = W25N_Wait_Until_Not_Busy();
    if (operation_status != W25N_READY) goto error;

    operation_status = W25N_Write_Disable();
    
error:
    return operation_status;
}

W25N_StatusTypeDef W25N_Read(uint8_t *p_buffer, uint16_t page_address, uint16_t column_address, uint16_t num_of_bytes)
{
	W25N_StatusTypeDef operation_status;

	operation_status = W25N_Wait_Until_Not_Busy();
	if (operation_status != W25N_READY) goto error;

	operation_status = W25N_Page_Data_Read(page_address);
	if (operation_status != W25N_HAL_OK) goto error;

	operation_status = W25N_Wait_Until_Not_Busy();
	if (operation_status != W25N_READY) goto error;

	operation_status = W25N_Read_Data(p_buffer, column_address, num_of_bytes);
	if (operation_status != W25N_HAL_OK) goto error;

	operation_status = W25N_Check_ECC_Status();

error:
	return operation_status;
}

W25N_StatusTypeDef W25N_Write(uint8_t *p_buffer, uint16_t page_address, uint16_t column_address, uint16_t num_of_bytes)
{
	W25N_StatusTypeDef operation_status;

	operation_status = W25N_Wait_Until_Not_Busy();
	if (operation_status != W25N_READY) goto error;

	operation_status = W25N_Write_Enable();
	if (operation_status != W25N_HAL_OK) goto error;

	operation_status = W25N_Load_Program_Data(p_buffer, column_address, num_of_bytes);
	if (operation_status != W25N_HAL_OK) goto error;

	operation_status = W25N_Program_Execute(page_address);
	if (operation_status != W25N_HAL_OK) goto error;

	operation_status = W25N_Wait_Until_Not_Busy();
	if (operation_status != W25N_READY) goto error;

	operation_status = W25N_Check_Program_Failure();

error:
	return operation_status;
}

//change parameter name if it turns out to be block address
W25N_StatusTypeDef W25N_Erase(uint16_t page_address)
{
    W25N_StatusTypeDef operation_status;

    operation_status = W25N_Wait_Until_Not_Busy();
    if (operation_status != W25N_READY) goto error;

    operation_status = W25N_Write_Enable();
    if (operation_status != W25N_HAL_OK) goto error;
    
    operation_status = W25N_Block_Erase_128KB(page_address);
    if (operation_status != W25N_HAL_OK) goto error;

    operation_status = W25N_Wait_Until_Not_Busy();
    if (operation_status != W25N_READY) goto error;

    operation_status = W25N_Check_Erase_Failure();

error:
    return operation_status;
}

W25N_StatusTypeDef W25N_Reset_And_Init()
{
    W25N_StatusTypeDef operation_status;
    uint8_t register_1_contents = 0b00000010;
    uint8_t register_1_address = 0xA0;
    uint8_t register_2_contents = 0b00011000;
    uint8_t register_2_address = 0xB0;

    operation_status = W25N_Wait_Until_Not_Busy();
    if (operation_status != W25N_READY) goto error;

    operation_status = W25N_Device_Reset();
    if (operation_status != W25N_HAL_OK) goto error;

    operation_status = W25N_Write_Status_Register(register_1_address, register_1_contents);
    if (operation_status != W25N_HAL_OK) goto error;

    operation_status = W25N_Write_Status_Register(register_2_address, register_2_contents);

error:
    //All called functions will deselect the W25N under normal operations or if an error occurs
    HAL_GPIO_WritePin(W25N_nWP_GPIO, W25N_nWP_PIN, GPIO_PIN_RESET); //disable all write/program/erase functionality
    HAL_GPIO_WritePin(W25N_nHOLD_GPIO, W25N_nHOLD_PIN, GPIO_PIN_SET); //allow device operations (disable hold state)
    return operation_status;
}

//###############################################################################################
//Helper Functions
//###############################################################################################
W25N_StatusTypeDef W25N_SPI_Transmit_Word_16Bit(uint16_t word_16bit)
{
    W25N_StatusTypeDef operation_status;
    uint8_t word_16bit_high_byte = word_16bit >> 8; //value is truncated & high byte stored
    uint8_t word_16bit_low_byte = word_16bit; //value is truncated & low byte stored

    operation_status = HAL_SPI_Transmit(&W25N_SPI, &word_16bit_high_byte, 1, W25N_SPI_DELAY);
    if (operation_status != W25N_HAL_OK) goto error;
    operation_status = HAL_SPI_Transmit(&W25N_SPI, &word_16bit_low_byte, 1, W25N_SPI_DELAY);

error:
    return operation_status;
}

//###############################################################################################
//Public Helper Functions
//###############################################################################################
uint16_t W25N_Page_Address_To_Block_Address(uint16_t page_address)
{
    return page_address / W25N_PAGES_PER_BLOCK;
}
